app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-11-08 14:57:09.692485"], ["id", 1]]
---
  def update

    @article = Article.find(params[:id])
    if !params[:article][:title].empty?
      @article.update(title: params[:article][:title], description: params[:article][:description])